################
# GENERAL SECTION
################

GENDER_CHOICES = (
    ('M', 'МЪЖ'),
    ('F', 'ЖЕНА'),
    ('O', 'ДРУГ')
)

EMAIL_PHONE_PURPOSE_CHOICES = (
    ('P', 'ЛИЧЕН'),
    ('W', 'СЛУЖЕБЕН')
)

# TODO - A DEVELOPPER LES CHOIX
POSTAL_ADDRESS_PURPOSE_CHOICES = (
    ('D', 'Delivery Address'),
    ('B', 'Billing Address'),
    ('C', 'Contact Address')
)

# TODO: A FAIRE UN TRUC POUR LES BOQUINS
MEDIA_CHOICES = [
    ('Audio', (
        ('vinyl', 'Vinyl'),
        ('cd', 'CD'),
    )
     ),
    ('Video', (
        ('vhs', 'VHS Tape'),
        ('dvd', 'DVD'),
    )
     ),
    ('unknown', 'Unknown'),
]

PREFERRED_CONTACT_METHOD = (
    ('TG', 'ТЕЛЕГРАМ'),
    ('EM', 'ИМЕЙЛ'),
    ('PH', 'МОБИЛЕН'),
)

################
# BOOKS SECTION
################
BOOK_CURRENT_STATUS = (
    ('F', 'СВОБОДНА'),
    ('R', 'ЗАЕТА'),
    ('WR', 'ИЗЧАКВАЩА ПОЛУЧАВАНЕ ОТ ЧИТАТЕЛ'),
    ('WO', 'ИЗЧАКВАЩА ПОЛУЧАВАНЕ ОТ СОБСТВЕНИК'),
    ('S', 'ПРОДАДЕНА'),
    ('L', 'ЗАГУБЕНА'),
    # ('TR', 'ПЪТУВАЩА'),
    # ('BR', 'БРАКУВАНА'),
)

# SHORT LANG LIST
BOOK_LANG_CHOICES = (
    ('BGN', 'Български'),
    ('ENG', 'Английски'),
    ('RUS', 'Руски'),
    ('FRA', 'Френски'),
    ('DEU', 'Немски'),
    ('SPA', 'Испански'),
    ('GRE', 'Гръцки'),
    ('POR', 'Португалски'),
    ('JAP', 'Японски'),
    ('CHI', 'Китайски'),
)

BOOK_CONDITION = (
    (1, 'Отлично'),
    (2, 'Добро'),
    (3, 'Лошо')
)

BOOK_RELEASE = (
    (1, 'Първо'),
    (2, 'Второ'),
    (3, 'Трето'),
    (4, 'Четвърто'),
    (5, 'Пето'),
    (9, 'БЕЗ'),
)

BOOK_RUNNER_STATUS = (
    (1, 'Взимане от собственик'),
    (2, 'Доставяне до собственик'),
    (3, 'Взимане от ХЪБ'),
    (4, 'Доставяне до ХЪБ'),
    (5, 'Взимане от междинно звено'),
    (6, 'Доставяне до междинно звено'),
)

BOOK_RUNNER_DELIVERY_RATING = (
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5),
)

# ВДЪХНОВЕНА ОТ ИГРАТА БУКУЪРМ:
# https://web.archive.org/web/20070819051143/http://www.popcap.com/games/bookwormadventures
# ОРИГИНАЛЕН СПИСЪК:
# https://www.supercheats.com/pc/walkthroughs/bookwormdeluxe-walkthrough02.txt
BOOR_READER_RANKING = (
    (1, 'Продавач на книги'),
    (2, 'Продавач на енциклопедии'),
    (3, 'Стажант'),
    (4, 'Чиновник'),
    (5, 'Писател'),
    (6, 'Главен Счетоводител'),
    (7, 'Книговезец'),
    (8, 'Коректор Печат'),
    (9, 'Помощник библиотекар'),
    (10, 'Библиотекар'),
    (11, 'Старши библиотекар'),
    (12, 'Архивист'),
    (13, 'Велик архивист'),
    (14, 'Редактор'),
    (15, 'Главен редактор'),
    (16, 'Издател'),
    (17, 'Почетен издател'),
    (18, 'Графолог'),
    (19, 'Лексикоман Любител'),
    (20, 'Напреднал Лексикоман'),
    (21, 'Велик Лексикоман'),
    (22, 'Шампион по Судоку'),
    (23, 'Чудовището от речника'),
    (24, 'Преводач на Хари Потър'),
    (25, 'Преводач на Франц Кафка'),
    (26, 'Преводач на Джеймс Джойс'),
    (27, 'Книжен плъх'),
    (28, 'Гражданин на Буктопия'),
    (29, 'Буктопия Гуру'),
    (30, 'Велик Везир на Буктопия'),
)
